{"data":{"markdownRemark":{"html":"<p>I did a lot of stuff this week. Here are some highlights.</p>\n<h3>Day 1</h3>\n<ul>\n<li>\n<p>I have a lovely, patient and wonderful mother. She woke up at 4:00 AM to drive me to KCI for my 6:00 AM flight out to San Francisco the morning of Aug. 15. I slept the entire flight, waking up to the pilot announcing our descent into San Francisco.</p>\n</li>\n<li>\n<p>My good friend Jon Volkin picked me up from the airport. Jon worked for Gilead Sciences this summer; I had planned this trip to line up with his final week in the city. He had finished his internship the previous week, leaving us 5 days to explore and enjoy the sites. And for me to do some networking with KU alum and visit a few cool companies HQ'ed here.</p>\n</li>\n<li>\n<p>We went to the California Academy of Sciences after a delicious breakfast (I appropriately opted to try out the San Francisco omlette, topped with fresh avocado. It was fuego.) where we explored the aquarium, the indoor rainforest, some incredible nature photography exhibits and the living roof.</p>\n</li>\n<li>\n<p>Equipped with some Hell or High Watermelon beer, we spent the evening at Dolores Park. Such a cool place, and incredibly lively for a monday evening.</p>\n</li>\n<li>\n<p>Enchiladas at the El Toro Taqueria for dinner. Didn't have to pay extra for the guac. Take notes, Chipotle.</p>\n</li>\n<li>\n<p>Walked through the <a href=\"https://en.wikipedia.org/wiki/Clarion_Alley_Mural_Project\">Clarion Alley</a> on Valencia. A beautiful variety of street art, including a very weird but informative anti-heroin PSA thing and this pro-community piece below:</p>\n</li>\n</ul>\n<p><img src=\"mural.png\"></p>\n<h3>Day 2</h3>\n<ul>\n<li>\n<p>Grabbed coffee with Brad Garlinghouse, a KU Alum and active investor in the tech industry here. All things considered, Brad is a badass. He was instrumental in organizing the <a href=\"http://blog.college.ku.edu/students/tech-trek-connects-jayhawks-to-silicon-valley/\">KU Tech Trek</a>, which I participated in its inaugural year. When I initially reached out to him to set up a meeting he got back to me within 5 minutes, happy to set up a time to talk. We talked about tech, my career plans, some startups he is involved with and some project ideas for this coming school year.</p>\n</li>\n<li>\n<p>Toured Airbnb HQ with Noah Hendrix and Sally Carmichael, two recent KU graduates. Noah is a Software Engineer and Sally is a Graphic Designer. What do they share in common? They are both awesome people. Two of Airbnb's three co-founders have Industrial Design degrees from RISD, and it definitely shows through in the <a href=\"http://www.wired.com/2013/12/airbnb-gets-stylish-new-headquarters/\">beautifully crafted spaces</a> on all three floors of the office. Many rooms are inspired from actual Airbnb listings, and many more are inspired by San Francisco landmarks (e.g Dolores Park). I do not exaggerate when I say every nook and cranny of the office is a potential workspace. After the tour we talked about the projects they are both working on and life in the city. Noah gave me some great interview prep advice, and we discussed my coming semester at KU.</p>\n</li>\n<li>\n<p>Ate some yummy street tacos.</p>\n</li>\n<li>\n<p>Shopped around Haight St. with Jon. Saw the famous Haight/Ashbury intersection; it lived up to it's hippy-culture reputation. I saw a sign in front of one of the stores, \"Keep Haight St. Weird.\" Do not worry, storeowner. It is most definitely weird. Bought some cool socks.</p>\n</li>\n</ul>\n<p><img src=\"haight.png\"></p>\n<ul>\n<li>\n<p>Enjoyed a classic American meal at Barney's Burgers. Baja Burger, spicy curly fries, Mocha milkshake. Nom.</p>\n</li>\n<li>\n<p>Jameson Mule and Anchor Steam at a little Irish pub down the way from Barney's. Talked about <a href=\"https://libraryofbabel.info/\">The Library of Babel</a>, as an offshoot of a discussion about <a href=\"https://www.youtube.com/watch?v=GDrBIKOR01c\">messages for the future and space shit</a>.</p>\n</li>\n</ul>\n<h3>Day 3</h3>\n<ul>\n<li>\n<p>Quick breakfast and gift shopping down in the Noe Valley. Bought a cool Pyramid Building print.</p>\n</li>\n<li>\n<p>Did some solo adventuring along Market St. Enjoyed some Blue Bottle iced coffee on the Pier.</p>\n</li>\n</ul>\n<p><img src=\"pier.png\"></p>\n<ul>\n<li>Spent a lazy afternoon at Dolores Park listening to Jon's <a href=\"https://open.spotify.com/user/1267605225/playlist/6OWsEuLYjihDeIem3OnaJJ\">\"Entertain Me\"</a> Spotify playlist and drinking some more Hell or High Watermelon.</li>\n</ul>\n<p><img src=\"beer.png\"></p>\n<p><img src=\"dolorespark.png\"></p>\n<ul>\n<li>\n<p>Observed a bunch of British tourists playing what I can only describe as a large-scale game of speedball. Two teams of 10-15 people lined up about 20 feet away from each other, with a large water bottle in directly in the center of all participants. Team members would take turns trying to throw a soccer ball at the water bottle -- upon a successful hit the entire team starts drinking until someone from the other team runs to the middle and sets the bottle back up. +1 to the Brits for the innovative way to imbibe as a group.</p>\n</li>\n<li>\n<p>Snagged a quick lunch at Dolores Park Cafe. Chicken Pesto sammy.</p>\n</li>\n<li>\n<p>Met up with Kelsey's and one of her co-workers at El Techo, an ultra-cool rooftop bar in the Mission. Drank many margaritas, and enjoyed a beautiful view of the skyline.</p>\n</li>\n<li>\n<p>Many more drinks at Elbo Room, a cool dive bar. Met a product manager and software engineer for Intuit.</p>\n</li>\n<li>\n<p>Fell asleep watching John Oliver on HBO Go.</p>\n</li>\n</ul>\n<h3>Day 4</h3>\n<ul>\n<li>Woke up early and drove out to Muir Woods for a morning of hiking. The air is so clear out there. And the trees. They are quite tall. I think they have a reputation for that or something.</li>\n</ul>\n<p><img src=\"woods1.png\"></p>\n<p><img src=\"woods2.png\"></p>\n<p><img src=\"woods3.png\"></p>\n<ul>\n<li>Continued the drive on to Stinson Beach for an afternoon in the sun. Good vibes. Took Highway 1 back to San Francisco, enjoying some killer views on the way.</li>\n</ul>\n<p><img src=\"beach.png\"></p>\n<p><img src=\"stinson.png\"></p>\n<ul>\n<li>Met up with a bunch of Kansas City natives at the Brixton for drinks. Caught up with my friend Marcus Tetwiler who's working at <a href=\"http://www.wonolo.com/\">Wonolo</a>, Zach Colby, Abba and Camille Goehausen and Danielle Norton. Lots of fun.</li>\n<li>Ended the night at the Tipsy Pig.</li>\n</ul>\n<h3>Day 5</h3>\n<ul>\n<li>My final full day in the city. Great breakfast at La Boulangerie to start the day, picked up some 21st Amendment as a gift for my brother and dad.</li>\n<li>Spent another afternoon in Dolores Park. More good tunes. Perfect weather.</li>\n<li>Helped Jon and Kelsey pack up their car before their 27 hour roadtrip back to Lawrence. They left around 5:30.</li>\n<li>Met up with my good friend and fellow CS student Cole Jurden for a happy hour at the <a href=\"https://www.thanx.com/\">Thanx</a> offices near the Civic Center. Met lots of cool people. Ben, Sterling, Cristina 1, Cristina 2, Kate, Zach, Dan, Sean -- mostly writing these names for my own memory. Such a cool office.</li>\n<li>Went to Bar None in the Marina, i.e. an adult version of the Jayhawk Cafe Pine Room. I proceeded to get very drunk and stay out very late. Caught an uber back to Oakland with a very sleepy Cole in the wee hours of the morning. Ibuprofen anyone?</li>\n</ul>\n<h3>Day 6</h3>\n<ul>\n<li>Took the BART to SFO. Tried the Chicken Fries from Burger King. 0/10 would not eat again. Caught my flight home at 5. Nice to sleep in my own bed.</li>\n<li>An eventful and thoroughly exhausting trip. I'm glad I went.</li>\n</ul>","timeToRead":5,"tableOfContents":"<ul>\n<li><a href=\"/posts/san-fran-adventures/#day-1\">Day 1</a></li>\n<li><a href=\"/posts/san-fran-adventures/#day-2\">Day 2</a></li>\n<li><a href=\"/posts/san-fran-adventures/#day-3\">Day 3</a></li>\n<li><a href=\"/posts/san-fran-adventures/#day-4\">Day 4</a></li>\n<li><a href=\"/posts/san-fran-adventures/#day-5\">Day 5</a></li>\n<li><a href=\"/posts/san-fran-adventures/#day-6\">Day 6</a></li>\n</ul>","fields":{"tagSlugs":["/tags/travel/","/tags/vacation/"]},"frontmatter":{"title":"Adventures in San Francisco","tags":["travel","vacation"],"date":"2016-08-16T00:12:03.000Z","author":{"id":"Evan Nichols","bio":"I'm a software engineer in NYC who likes React, Node, GraphQL and other cool web technologies. I also like running and dogs."}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/san-fran-adventures"}}