{"data":{"markdownRemark":{"html":"<p>I designed and implemented a MIPS Single Cycle CPU as the final project for my Computer Architecture class at KU, EECS 645. The CPU is comprised of 17 separate components, which we developed individually throughout the semester. The CPU takes in 32-bit instructions, and can be tested using a workbench in Vivado.</p>\n<p><img src=\"block.png\" alt=\"CPU Block Diagram\"></p>\n<p>Using MARS, a MIPS Assembler and Runtime simulator, I converted the following assembly program into 32-bit instructions that the CPU could recognize. The output was placed into the instruction memory component.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">    addi $t0, $zero, 5\n    addi $t1, $zero, 7\n    start:\tsw\t$t0,  0($sp)\n    sw\t$t1, -4($sp)\n    lw\t$s0,  0($sp)\n    lw\t$s1, -4($sp)\n    beq\t$s0, $s1, Else\n    add\t$s3, $s0, $s1\n    j\tExit\n    Else:\tsub\t$s3, $s0, $s1\n    Exit:\tadd\t$s0, $s0, $s3\n    or\t$s1, $s1, $s3\n    addi\t$t0, $t0,  3\n    addi\t$t1, $t1,  3\n    addi\t$sp, $sp, -8\n    j\tstart</code></pre></div>\n<p>I confirmed the CPU was working correctly by comparing its final register values to that of the MARS simulator after running the assembly program.</p>\n<p>The CPU does not support recurisve functions because I did not implement the Jump And Link (JAL) MIPS instructions,</p>\n<p>As a CS student, I rarely venture this deep into the EE/CoE side of the spectrum. This project was a great exercise in learning the basics of CPU architecture. Understanding how programs are compiled and interpreted by the CPU as MIPS instructions provided a great complement to the work I do in higher-level programming languages. There is a certain \"completeness\" I feel now understanding how, say, a C program is transformed into object code and executed by a CPU. With that said, I think I'll stick to the high-level languages.</p>\n<p>Check out the code for this project <strong><a href=\"https://github.com/e-nichols/EECS_645/tree/master/MIPS_Single_Cycle_CPU\">here</a></strong>.</p>","timeToRead":1,"tableOfContents":"","fields":{"tagSlugs":["/tags/computer-architecture/","/tags/mips/"]},"frontmatter":{"title":"MIPS Single Cycle CPU","tags":["Computer Architecture","MIPS"],"date":"2014-06-01T00:12:03.000Z","author":{"id":"Evan Nichols","bio":"I'm a software engineer in NYC who likes React, Node, GraphQL and other cool web technologies. I also like running and dogs."}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/projects/mips-single-cycle-cpu/"}}